//Active Chart  Это ТРЕУГОЛЬНИКИ ВЫБОРА . + Прямоугольниуи. 

/*
Диаграмма состояний - Это ОВАЛЫ



Пример : Котенок

Слепой котенок 
Важный момент Описываем котика для игры.
Есть два состояния для Кота 
1) Котенок прозрел
2) котенок мертвый
В любое из них может перейти нашь кот
Опишем условия прикоторых они произойдут
Есть уровень здоровья
1) Достиг возраста
2) По уровню здоровья Котик мертв.

Пример. Сделать тазик
Есть лист металла- 1 состояние
По какому условию лист перейдет в следующее состояние ?
В диаграмме состояний мы не видим результат а видим лишь изменение состояний!!!
Нарезка листа на гельятине. - 2 Заготовка 
Шнампуем на пресс машине - 3 Состояние












*/